---
kind: method
id: M:Autodesk.Revit.UI.TextEditorOptions.GetTextEditorOptions
source: html/50528465-bfa5-2691-cc0f-00d36e4e6606.htm
---
# Autodesk.Revit.UI.TextEditorOptions.GetTextEditorOptions Method

Returns the current Revit instance's TextEditorOptions.

## Syntax (C#)
```csharp
public static TextEditorOptions GetTextEditorOptions()
```

## Returns
The TextEditorOptions for the current Revit instance.